/**
 * @author procedure sail
 * @date 2021/10/6 13:06
 *
 *       1.9 猴⼦吃桃问题
 *  题⽬：猴⼦吃桃问题：猴⼦第⼀天摘下若⼲个桃⼦，当即吃了⼀半，还不瘾，⼜多吃了⼀个 第⼆天早上⼜将剩下的桃⼦
 *  吃掉⼀半，⼜多吃了⼀个。以后每天早上都吃了前⼀天剩下的⼀半零⼀个。到第10天早上想再吃时，⻅只剩下⼀个桃⼦
 *  了。求第⼀天共摘了多少。
 *  程序分析：采取逆向思维的⽅法，从后往前推断
 *   1,4,10,22,46,94...
 */
public class Twelve {
    public static void main(String[] args) {
        //1.用一个变量存储猴子第一天摘了多少
        int sum=0;
        for (int i = 1; i <=10 ; i++) {
            //第十天剩下的桃子
            if (i==1){
                sum=1;
            }
            if (i>1){
                sum=sum*2+2;
            }
        }
        System.out.println(sum);
    }
}
